// import {data} from "./pepe_data";
var myChart = echarts.init(document.getElementById('main'));

// const data = [
//   [10, 16, 3, 'A'],
//   [16, 18, 15, 'B'],
//   [18, 26, 12, 'C'],
//   [26, 32, 22, 'D'],
//   [32, 56, 7, 'E'],
//   [56, 62, 17, 'F']
// ].map(function (item, index) {
//   return {
//     value: item,
//     itemStyle: {
//       color: '#604a7b'
//     }
//     // itemStyle: {
//     //   color: colorList[index]
//     // }
//   };
// });

const data = [
  [ -107520,  -105840, 379476],
  [ -105840,  -105180, 380336],
  [ -105180,  -104820, 380798],
  [ -104820,  -104220, 382327],
  [ -104220,  -104040, 391693],
  [ -104040,  -103560, 392360],
  [ -103560,  -103500, 406688],
  [ -103500,  -103020, 412778],
  [ -103020,  -102900, 413426],
  [ -102900,  -102600, 427881],
  [ -102600,  -102360, 428560],
  [ -102360,  -102060, 429206],
  [ -102060,  -102000, 441837],
  [ -102000,  -101880, 451735],
  [ -101880,  -101820, 464281],
  [ -101820,  -101640, 472543],
  [ -101640,  -101400, 475117],
  [ -101400,  -101280, 475479],
  [ -101280,  -101160, 484092],
  [ -101160,  -100920, 491398],
  [ -100920,  -100680, 501120],
  [ -100680,  -100560, 508925],
  [ -100560,  -100260, 544134],
  [ -100260,  -100200, 544680],
  [ -100200,  -100080, 458079],
  [ -100080,   -99900, 444710],
  [  -99900,   -99660, 425082],
  [  -99660,   -99480, 431498],
  [  -99480,   -99420, 426022],
  [  -99420,   -99000, 430276],
  [  -99000,   -98100, 429609],
  [  -98100,   -98040, 421632],
  [  -98040,   -97680, 420987],
  [  -97680,   -97500, 420339],
  [  -97500,   -97440, 407793],
  [  -97440,   -97200, 411846],
  [  -97200,   -97140, 410317],
  [  -97140,   -96780, 407743],
  [  -96780,   -96300, 403489],
  [  -96300,   -95880, 387977],
  [  -95880,   -95340, 385936],
  [  -95340,   -95220, 379177],
  [  -95220,   -94800, 371371],
  [  -94800,   -94740, 364955],
  [  -94740,   -94680, 357363],
  [  -94680,   -94500, 348751],
  [  -94500,   -94440, 347960],
  [  -94440,   -94200, 346215],
  [  -94200,   -94080, 336317],
  [  -94080,   -93960, 323686],
  [  -93960,   -93900, 323255],
  [  -93900,   -93780, 322576],
  [  -93780,   -93720, 313210],
  [  -93720,   -93600, 313083],
  [  -93600,   -93540, 312958],
  [  -93540,   -93420, 311916],
  [  -93420,   -92580, 310957],
  [  -92580,   -92520, 304868],
  [  -92520,   -92220, 232860],
  [  -92220,   -91964, 232860],
].map(function (item, index) {
  return {
    value: item,
    itemStyle: {
      color: '#4f81bd',
    }
    // itemStyle: {
    //   color: colorList[index]
    // }
  };
});

const option = {
  title: {
    text: 'RLB/WETH',
    left: 'center'
  },
  tooltip: {},
  xAxis: {
    // type: "index",
    scale: true
  },
  yAxis: {},
  dataZoom:[
    // {
    //   type: 'inside',
    //   start: 30,
    //   end: 60
    // },
    {
      show: true,
      type: 'slider',
      top: '90%',
      start: 30,
      end: 60
    }
  ],
  series: [
    {
      type: 'custom',
      renderItem: function (params, api) {
        var yValue = api.value(2);
        var start = api.coord([api.value(0), yValue]);
        var size = api.size([api.value(1) - api.value(0), yValue]);
        var style = api.style();
        return {
          type: 'rect',
          shape: {
            x: start[0],
            y: start[1],
            width: size[0],
            height: size[1]
          },
          style: style
        };
      },
      // label: {
      //   show: true,
      //   position: 'top'
      // },
      // dimensions: ['from', 'to', 'profit'],
      encode: {
        x: [0, 1],
        y: 2,
        tooltip: [0, 1, 2],
        // itemName: 3
      },
      data: data,
      markLine: {
        symbol:"none",               //去掉警戒线最后面的箭头
        label:{
          position:"start"          //将警示值放在哪个位置，三个值“start”,"middle","end"  开始  中点 结束
        },
        data : [
          {
            silent:false,             //鼠标悬停事件  true没有，false有
            lineStyle:{               //警戒线的样式  ，虚实  颜色
              // type:"solid",
              color:"#FA3934",
              width: 4,
            },
            xAxis:  -100792          // 警戒线的标注值，可以有多个yAxis,多条警示线   或者采用   {type : 'average', name: '平均值'}，type值有  max  min  average，分为最大，最小，平均值
          }
        ]
      }
    },
    // {
    //   type:"line",
    // }
  ]
};

myChart.setOption(option);